  var local_database = [{
    date:"Sept 16 2020",
    title:"莫言：对年轻人而言，最好的老师就是阅读。",
    post_image:"/images/avatar/1.png",
    author_image:"/images/post/moyan.png",
    content:"莫言：我童年最大的痛苦就是没有书读，而现在最大的痛苦就是书太多读不过来。我总结出一条经验：\
    当书越多的时候，实际上人读书的热情就越淡薄；当书越少或者找不到书读的时候，人渴望读书的热情就会越高。\
    在这里，主要讲一下我读书的经历以及阅读对于创作以及人生的影响，希望同大家一起分享。",
    view_num:"58.8W",
    collect_num:"66.6W",
    author:"五十七",
    dateTime:"24小时前",
    detail:"我是1955年出生于山东的一个农村，十几岁的时候正赶上文化大革命，辍学回家。\
    但我已经具备了很强的阅读能力与对读书的渴望。\
    当时农村的物质生活非常艰苦，再加上文化大革命对文化的摧残，能够找到的可读的书籍屈指可数。\
    为了读到一本书，我常常要付出沉重的劳动来进行交换。\
    \n\n记得我邻村同学家里有一本绘图版的《封神演义》，为了读到这本书，经常要去那个同学家中替他推磨。\
    推磨是让孩子痛苦不堪的一种劳动，因为它非常单调，没有任何趣味。\
    后来我认识了一个小学老师，他收藏了十几本革命小说，比如《苦菜花》《林海雪原》《青春之歌》等。\
    这些书被我借到之后，都是用最快的时间读完。当时我们家养了两只羊，放羊的任务就落在我的肩上，但借到书后，我往往钻到草垛里以最快的速度把这两本书看完。\
    书读完了，天也黑了，羊饿得“咩咩”直叫，回到家难免要受到家长的惩罚，即便这样心里也不后悔。",
    postId:0
  },{
    date:"Nov 6 2020",
    title:"鲁迅：不在沉默沉静中爆发，就在沉默沉静中灭亡。",
    post_image:"/images/avatar/2.png",
    author_image:"/images/post/luxun.jpg",
    content:"我在年青时候也曾经做过许多梦，后来大半忘却了，但自己也并不以为可惜。所谓回忆者，虽说可以使人欢欣，有时也不免使人寂寞，使精神的丝缕还牵着己逝的寂寞的时光，又有什么意味呢，而我偏苦于不能全忘却，这不能全忘的一部分，到现在便成了《呐喊》的来由。",
    view_num:"88.8W",
    collect_num:"186.6W",
    author:"胡生",
    dateTime:"2天前",
    detail:"我有四年多，曾经常常，——几乎是每天，出入于质铺和药店里，年纪可是忘却了，总之是药店的柜台正和我一样高，质铺的是比我高一倍，\
    我从一倍高的柜台外送上衣服或首饰去，在侮蔑里接了钱，再到一样高的柜台上给我久病的父亲去买药。回家之后，又须忙别的事了，因为开方的医生是最有名的，\
    以此所用的药引也奇特冬天的芦根，经霜三年的甘蔗，蟋蟀要原对的，结子的平地木，……多不是容易办到的东西。然而我的父亲终于日重一日的亡故了。\
    \n\n有谁从小康人家而坠入困顿的么，我以为在这途路中，大概可以看见世人的真面目；我要到 N进K学堂去了，仿佛是想走异路，逃异地，去寻求别样的人们。我的母亲没有法，\
    办了八元的川资，说是由我的自便；然而伊哭了，这正是情理中的事，因为那时读书应试是正路，所谓学洋务，社会上便以为是一种走投无路的人，只得将灵魂卖给鬼子，\
    要加倍的奚落而且排斥的，而况伊又看不见自己的儿子了。\n\n然而我也顾不得这些事，终于到N去进了K学堂了，在这学堂里，我才知道世上还有所谓格致，算学，地理，历史，绘图和体操。\
    生理学并不教，但我们却看到些木版的《全体新论》和《化学卫生论》之类了。我还记得先前的医生的议论和方药，和现在所知道的比较起来，便渐渐的悟得中医不过是一种有意的或无意的骗子，\
    同时又很起了对于被骗的病人和他的家族的同情；而且从译出的历史上，又知道了日本维新是大半发端于西方医学的事实。",
    postId:1
  },{
    date:"May 5 2020",
    title:"冰心：白的花胜似绿的叶，浓的酒不如淡的茶。",
    post_image:"/images/avatar/3.png",
    author_image:"/images/post/binxin.jpg",
    content:"《繁星·春水》的主题大致包括三个方面的内容：一是对母爱与童真的歌颂；二是对大自然的崇拜和赞颂；三是对人生的思考与感悟。这本诗集把对母爱的歌颂，对童心的呼唤，对大自然的咏叹完美地融合在一起，营造出一个至善至美的世界，感情真挚深沉，语言清新淡雅而晶莹明丽，给人以无穷的回味和启迪。",
    view_num:"28.8W",
    collect_num:"56.6W",
    author:"林小晓",
    dateTime:"2小时前",
    detail:"母亲啊！撇开你的忧愁，容我沉酣在你的怀里，只有你是我灵魂的安顿。\
    \n\n母亲啊！天上的风雨来了，鸟儿躲到它的巢里，心中的风雨来了，我只躲到你的怀里。小小的花，也想抬起头来，感谢春光的爱————然而深厚的恩慈，反使她终于沉默。\
    \n\n母亲呵！你是那春光么？童年呵！是梦中的真，是真中的梦，是回忆时含泪的微笑。真理，在婴儿的沉默中，不在聪明人的辩论里。\
    婴儿，是伟大的诗人，在不完全的言语中，吐出最完全的诗句。\
    老年人对小孩子说：“流泪罢，叹息罢，世界多么无味呵！”小孩子笑着说：“饶恕我，先生！我不会设想我未经过的事。”小孩子对老年人说：“笑罢，跳罢，世界多么有趣呵！”老年人叹着说：“原谅我，孩子！我不忍回忆我所已经过的事。”",
    postId:2
  },{
    date:"Aug 18 2020",
    title:"朱自清：望着月色的荷塘，让人心生宁静。",
    post_image:"/images/avatar/4.png",
    author_image:"/images/post/zhuziqing.jpg",
    content:"路上只我一个人，背着手踱着。这一片天地好像是我的；我也像超出了平常的自己，到了另一世界里。我爱热闹，也爱冷静；爱群居，也爱独处。像今晚上，一个人在这苍茫的月下，什么都可以想，什么都可以不想，便觉是个自由的人。",
    view_num:"88.8W",
    collect_num:"96.6W",
    author:"张诗韵",
    dateTime:"一周前",
    detail:"曲曲折折的荷塘上面，弥望的是田田的叶子。叶子出水很高，像亭亭的舞女的裙。\
    层层的叶子中间，零星地点缀着些白花，有袅娜地开着的，有羞涩地打着朵儿的;\
    正如一粒粒的明珠，又如碧天里的星星，又如刚出浴的美人。微风过处，送来缕缕清香，仿佛远处高楼上渺茫的歌声似的。\
    \n\n这时候叶子与花也有一丝的颤动，像闪电般，霎时传过荷塘的那边去了。叶子本是肩并肩密密地挨着，这便宛然有了一道凝碧的波痕。\
    叶子底下是脉脉的流水，遮住了，不能见一些颜色;而叶子却更见风致了。",
    postId:3
  }
]

module.exports= {
  postList : local_database
}